<a href="https://colab.research.google.com/github/hannasss/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/pandas4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
from collections import OrderedDict
friend_list =[
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

인덱스 지정하여 출력

In [ ]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df = df[1:3]

In [ ]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
from collections import OrderedDict
friend_list =[
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [ ]:
df = df.loc[[0,2]]

In [ ]:
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [ ]:
from collections import OrderedDict
friend_list =[
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
### by column condition

조건 걸어서 출력

In [ ]:
df[df.age>25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[ (df.age>25)&(df.name=='Nate')]

   name  age      job
2  Nate   30  teacher

In [ ]:
##Filter Column

In [ ]:
###by index

In [ ]:
friend_list =[
    ['John',20,'student'],
    ['Jenny',30,'developer'],
    ['John',20,'teacher']
]
df = pd.DataFrame.from_records(friend_list)

In [ ]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   John  20    teacher

In [ ]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   John  20

In [ ]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

In [ ]:
##by column name

In [ ]:
df = pd.read_csv('friend_list_no_head.csv',header = None,names=['name','age','job'])

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

지정한 컬럼만 출력

In [ ]:
df_filtered =df [['name','age']]

In [ ]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df.filter( items = ['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

a가 들어가는 컬럼만 출력

In [ ]:
df.filter(like = 'a',axis = 1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

e로 끝나는 컬럼만 출력

In [ ]:
df.filter(regex='e$',axis =1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25